1s/ERP/Conf/Documents/Лико_СчетНаОплатуКлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_СчетНаОплатуКлиенту</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичнаяОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>Поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыСобытийОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСобытийОповещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПросроченнаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановыеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановыеОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСостоянияЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоздравлениеСДнемРождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОпроса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаявокНаТранспортировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаявокНаТранспортировку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_СчетНаОплатуКлиенту/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ОтветПередЗаписью, КэшированныеЗначения;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	Если ТребуетсяОткрытиеПечатнойФормы Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	//ДенежныеСредстваСервер.УстановитьВидимостьОплатыПлатежнойКартой(Элементы.ФормаОплаты);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		Если Параметры.Свойство("Основание") Тогда
			Основание = Параметры.Основание;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснование", "Видимость", ЗначениеЗаполнено(Объект.ДокументОснование));
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	// Подсистема "ОбменСКонтрагентами".
	//ПараметрыЭДОПриСоздании= ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	//ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	//ПараметрыЭДОПриСоздании.ДокументССылка = Объект.Ссылка;
	//ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	//ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	//
	//ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		Элементы.ГруппаИтого.ЦветФона = Новый Цвет();
	КонецЕсли;

	// ИнтеграцияСЯндексКассой
		//ИнтеграцияСЯндексКассой.ПриСозданииНаСервере(Параметры.Ключ, ЭтотОбъект,
		//	Элементы.ЭтапыГрафикаОплаты.КоманднаяПанель);
	// Конец ИнтеграцияСЯндексКассой
	
	// --> Начало Лико Ефимов ЕВВ 06.09.2017
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Менеджер = ТекущийПользователь;
		Объект.Организация = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизацияПродавец", ТекущийПользователь); 
		Объект.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			БанковскийСчет = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", Объект.Организация);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
			Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Объект.Организация, Константы.ВалютаРегламентированногоУчета.Получить());
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 06.09.2017
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТребуетсяОткрытиеПечатнойФормы Тогда
		
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Объект.Ссылка);
		
		Отказ = Истина;
		СамообслуживаниеКлиент.ПечатьСчетНаОплату(МассивСсылок);
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФинансыКлиент.ПроверитьЗаполнениеДокументаНаОсновании(
			Объект,
			Основание);
	КонецЕсли;
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
		ТребуетсяОткрытиеПечатнойФормы = Истина;
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПересчитатьСуммуДокумента();
	// --> Начало Лико Ефимов ЕВВ 29.10.2018
	Если НЕ ЗначениеЗаполнено(Объект.НазначениеПлатежа) Тогда
		ЗаполнитьНазначениеПлатежа();
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 29.10.2018
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	// Подсистема "ОбменСКонтрагентами".
	//ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	//ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	//ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	//ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	//ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	//ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Подсистема "ОбменСКонтрагентами".
	//ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	//ПараметрыОповещения.Форма = ЭтотОбъект;
	//ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	//ПараметрыОповещения.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	//ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	//
	//ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьНазначениеПлатежа(Команда)
	ЗаполнитьНазначениеПлатежа();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиКлиент.ОткрытьДеревоЭД(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
//Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПодпискуНаОповещения(Команда)
	
	ТипыСобытий = Новый Массив();
	ТипыСобытий.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСобытийОповещений.ВыпискаСчета"));
	ТипыСобытий.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСобытийОповещений.АннулированиеСчета"));
	ТипыСобытий.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСобытийОповещений.ИзменениеСчета"));
	
	РассылкиИОповещенияКлиентамКлиент.НастроитьПодпискуНаОповещенияИзОбъекта(
		Объект.Партнер,
		ТипыСобытий);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#Область Прочее

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УправлениеЭлементамиФормы();
	УстановитьДоступностьЭлементовПоЧастичнойОплате();
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	//Элементы.ЧастичнаяОплата.Видимость = ТипЗнч(Объект.ДокументОснование) <> Тип("СправочникСсылка.ДоговорыКонтрагентов");
	
	ТипыСобытий = Новый Массив();
	ТипыСобытий.Добавить(Перечисления.ТипыСобытийОповещений.ВыпискаСчета);
	ТипыСобытий.Добавить(Перечисления.ТипыСобытийОповещений.АннулированиеСчета);
	ТипыСобытий.Добавить(Перечисления.ТипыСобытийОповещений.ИзменениеСчета);
	
	РассылкиИОповещенияКлиентам.УстановитьВидимостьПодпискиНаОповещенияВОбъекте(
		Элементы.ГруппаПодпискаНаОповещения,
		Объект.Партнер,
		ТипыСобытий);
	ВалютаДокумента = Объект.Валюта;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БанковскийСчет", "Доступность", Истина);
	
	//УстановитьПривилегированныйРежим(Истина);
	//Соглашение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Соглашение");
	//
	//Если ТипЗнч(Соглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами")
	//	И Не ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
	//	ИспользуютсяДоговорыКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	//Иначе
	//	ИспользуютсяДоговорыКонтрагентов =
	//		ЗначениеЗаполнено(Соглашение)
	//		И ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Соглашение, "ИспользуютсяДоговорыКонтрагентов");
	//КонецЕсли;
	//
	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Договор", "Видимость", ИспользуютсяДоговорыКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовПоЧастичнойОплате()
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаДокумента", "ТолькоПросмотр", Не Объект.ЧастичнаяОплата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазначениеПлатежа()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Объект.НазначениеПлатежа = ДокументОбъект.ЗаполнитьНазначениеПлатежа();

КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПартнерКонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	ПартнерКонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПартнерКонтрагентПриИзмененииНаСервере()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	Объект.Договор = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Характеристика = Неопределено;
	ТоварыНоменклатураПриИзмененииНаСервере(Элементы.Товары.ТекущаяСтрока);
	ПересчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммуСтроки();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ТекущаяСтрока)
	
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	//ТекущиеДанные.СтавкаНДС = ТекущиеДанные.Номенклатура.СтавкаНДС;		
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПересчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", Объект.ЦенаВключаетНДС, ТекущаяСтрока.СтавкаНДС));
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
	СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме", "Количество");
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	// --> Начало Лико Ефимов ЕВВ 26.03.2020 
	ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
	// <-- Конец Лико Ефимов ЕВВ 26.03.2020 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ТекущаяСтрока = Неопределено, ПересчитыватьСуммуДокумента = Истина)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	КонецЕсли;
	
	//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	//
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	//
	//ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", Объект.ЦенаВключаетНДС, ТекущаяСтрока.СтавкаНДС));
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	
	Если НЕ Объект.ЧастичнаяОплата Тогда
		Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧастичнаяОплатаПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовПоЧастичнойОплате();
	ПересчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	
	ПересчитатьСуммыВсехСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыВсехСтрок()
	
	Для каждого Строка из Объект.Товары Цикл
		ПересчитатьСуммуСтроки(Строка, Ложь);
	КонецЦикла;
	ПересчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ПересчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент, ОтветилиНаВопрос = Ложь, Ответ = Неопределено)

	// --> Начало Лико Ефимов ЕВВ 10.03.2022
	Если НЕ ОтветилиНаВопрос Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветилиНаВопросОПересчете", ЭтотОбъект), "Пересчитать цены в новую валюту?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		// не будем ничего пересчитывать
		ВалютаДокумента = Объект.Валюта;
		Возврат; 
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 10.03.2022
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		ПриИзмененииВалютыСервер(
			Объект.Валюта,
			ЦенообразованиеКлиент.НеобходимПересчетВВалюту(Объект,ВалютаДокумента));
		ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ВалютаДокумента, Объект.Валюта);
		
	КонецЕсли;
	
	ВалютаДокумента = Объект.Валюта;
	
	ПересчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветилиНаВопросОПересчете(Ответ, ДопПараметры) Экспорт // --> Начало Лико Ефимов ЕВВ 13.04.2022
	
	ВалютаПриИзменении(Неопределено, Истина, Ответ);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 13.04.2022

&НаСервере
Процедура ПриИзмененииВалютыСервер(НоваяВалюта, ПересчитатьСуммы = Истина)
	
	Если ПересчитатьСуммы Тогда
		СтараяВалюта                = ВалютаДокумента;
		ДатаДокумента               = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
		СтруктураКурсовСтаройВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(СтараяВалюта, ДатаДокумента);
		СтруктураКурсовНовойВалюты  = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(НоваяВалюта,  ДатаДокумента);
		
		Ценообразование.ПересчитатьСуммыТабличнойЧастиВВалюту(
			Объект.Товары,
			Объект.ЦенаВключаетНДС,
			СтараяВалюта,
			НоваяВалюта,
			СтруктураКурсовСтаройВалюты,
			СтруктураКурсовНовойВалюты,
			Ложь,
			Ложь,
			"Количество");
		
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьПодбор(Команда)
//	
//	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
//	Иначе
//		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru='лк счет на оплату'"));
//	КонецЕсли;
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Организация",              Объект.Организация);
//	ПараметрыФормы.Вставить("ЦенаВключаетНДС",          Объект.ЦенаВключаетНДС);
//	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Ложь);
//	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                      Ложь);
//	ПараметрыФормы.Вставить("Валюта",                                  Объект.Валюта);
//	ПараметрыФормы.Вставить("Заголовок",                               ПараметрЗаголовок);
//	ПараметрыФормы.Вставить("Дата",                                    Объект.Дата);
//	ПараметрыФормы.Вставить("Документ",                                Объект.Ссылка);
//	
//	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
//	
//КонецПроцедуры

#Область ПодборыИОбработкаПроверкиКоличества

//&НаСервере
//Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
//	
//	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
//	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
//	
//	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
//		
//		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
//		СтруктураДействий = Новый Структура;
//		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
//		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//		СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
//		
//		СтруктураОтбора = Новый Структура("Номенклатура,Характеристика");
//		Если СтрокаТовара.Цена <> 0 Тогда
//			СтруктураОтбора.Вставить("Цена");
//		КонецЕсли;
//		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТовара);
//		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
//		Если НайденныеСтроки.Количество() = 0 Тогда
//			ТекущаяСтрока = Объект.Товары.Добавить();
//			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара);
//			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
//		Иначе
//			ТекущаяСтрока = НайденныеСтроки[0];
//			ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + СтрокаТовара.Количество;
//		КонецЕсли;
//		
//		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

//	КонецЦикла;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СообщитьОбОшибкахОткрытияПодбора(Отказ)
//	
//	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Валюта"" не заполнено'"), Объект.Ссылка, "Объект.Валюта",,Отказ);
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	//Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
	//	
	//	ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	//	
	//КонецЕсли;	

КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
//	
//	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
//	
//	ПересчитатьСуммуДокумента();
//	
//КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)
	
	ЗаказКлиента = Неопределено;
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ВводЗаказаКлиентаЗавершение", ЭтотОбъект), ЗаказКлиента, "Выберите заказ клиента", Тип("ДокументСсылка.ЗаказКлиента"));	
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗаказаКлиентаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьПоЗаказуНаСервере(Результат);
		ПересчитатьСуммуДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказуНаСервере(ЗаказКлиента)
	
	// Добавим все позиции из заказа клиента. Если такая позиция уже есть, увеличим количество по ней
	ТаблицаТоваров = ЗаказКлиента.Товары.Выгрузить(, "Номенклатура,Характеристика,СтавкаНДС,Цена,ЦенаДляДокументов,Количество");
	ТаблицаТоваров.Колонки.Добавить("Валюта");
	ТаблицаТоваров.Колонки.Добавить("Лико_ВалютаДляДокументов");
	ТаблицаТоваров.Колонки.Добавить("ЗаказКлиента");
	ТаблицаТоваров.ЗаполнитьЗначения(ЗаказКлиента.Валюта, "Валюта");
	ТаблицаТоваров.ЗаполнитьЗначения(ЗаказКлиента.ВалютаДляДокументов, "Лико_ВалютаДляДокументов");
	ТаблицаТоваров.ЗаполнитьЗначения(ЗаказКлиента, "ЗаказКлиента");
	ОбработатьЦеныВТаблицеТоваров(ТаблицаТоваров);
	ДобавитьТоварыИзТаблицы(ТаблицаТоваров);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЦеныВТаблицеТоваров(Товары)
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	СтруктураКурсов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУпр, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	Если СтруктураКурсов.Курс = 0 Тогда
		СтруктураКурсов.Курс = 1;
	КонецЕсли;
	
	Для каждого Строка из Товары Цикл
		Если ЗначениеЗаполнено(Строка.ЦенаДляДокументов) Тогда
			Если Строка.Лико_ВалютаДляДокументов = Объект.Валюта Тогда
				Строка.Цена = Строка.ЦенаДляДокументов;
			Иначе
				Если Объект.Валюта = ВалютаРегл Тогда
					Строка.Цена = Строка.ЦенаДляДокументов * СтруктураКурсов.Курс;
				Иначе
					Строка.Цена = Строка.ЦенаДляДокументов / СтруктураКурсов.Курс;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// --> Начало Лико Ефимов ЕВВ 22.01.2026
			// В таблице для переноса, которая пришла из формы подбора, цена всегда с НДС, поэтому уберем его из цены, если в счете ЦенаВключаетНДС = Ложь
			Если НЕ Объект.ЦенаВключаетНДС Тогда
				// Нужно убрать НДС
				Строка.Цена = Строка.Цена / (100 + ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(Строка.СтавкаНДС)) * 100;
			КонецЕсли;
			// <-- Конец Лико Ефимов ЕВВ 22.01.2026
			Если Объект.Валюта = ВалютаРегл Тогда
				Строка.Цена = Строка.Цена * СтруктураКурсов.Курс;
			Иначе
				Строка.Цена = Строка.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТоварыИзТаблицы(ТаблицаТоваров)
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	НакладнаяНаЭкспорт = Объект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
	Если НакладнаяНаЭкспорт Тогда
		СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС0);
	ИначеЕсли Объект.Дата >= Дата('20260101') Тогда
		СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);
	Иначе
		СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
	КонецЕсли;
	Для каждого Строка из ТаблицаТоваров Цикл
		
		//Попробуем найти строку в этом документе
	    Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("Характеристика", Строка.Характеристика);
		Отбор.Вставить("Цена", Строка.Цена);
		
		СтрокиДокумента = Объект.Товары.НайтиСтроки(Отбор);
		Если СтрокиДокумента.Количество() = 0 Тогда
			ТекущаяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Строка);
			ТекущаяСтрока.СтавкаНДС = СтавкаНДС;
		Иначе
			ТекущаяСтрока = СтрокиДокумента[0];
			КоличествоДоИзменения = ТекущаяСтрока.Количество;
			ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + Строка.Количество;
			Сообщить("Номенклатура " + Строка.Номенклатура + " / " + Строка.Характеристика
					+ " добавлена ранее: увеличено количество этикеток с " + Формат(КоличествоДоИзменения, "ЧГ=0") + " до " + Формат(ТекущаяСтрока.Количество, "ЧГ=0"));
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", Объект.ЦенаВключаетНДС, ТекущаяСтрока.СтавкаНДС));
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаказов(Команда)
	
	// --> Начало Лико Яцун 05.05.2022
	//ПараметрыОткрытия = Новый Структура("Склад,Контрагент,Дата,ТипПодбора,Партнер",
	//									ПолучитьСкладПоУмолчаниюНаСервере(),
	//									Объект.Контрагент,
	//									ТекущаяДата(),
	//									"ПоСпискуЗаказов",
	//									Объект.Партнер);
	//ОткрытьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаПодбора", ПараметрыОткрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("ПодборЗаказовПоОстаткамПоНаименованиюЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	Если Команда.Имя = "ПодборЗаказовПоОстаткамПоНаименованию" Тогда
		ТипПодбора = "ОстаткиПоНоменклатуре";
	ИначеЕсли Команда.Имя = "ПодборЗаказовПоОстаткамПоЗаказу" Тогда
		ТипПодбора = "ОстаткиПоЗаказу";
	ИначеЕсли Команда.Имя = "ПодборПоСпискуЗаказов" Тогда
		ТипПодбора = "ПоСпискуЗаказов";
	Иначе
		Возврат;
	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура("Склад,Контрагент,Дата,ТипПодбора,Партнер,Менеджер", ПолучитьСкладПоУмолчаниюНаСервере(), Объект.Контрагент, ТекущаяДата(), ТипПодбора, Объект.Партнер, Объект.Менеджер);
	ОткрытьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаПодбора", ПараметрыОткрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("ПодборЗаказовПоОстаткамПоНаименованиюЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// <-- Конец Лико Яцун 05.05.2022
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаказовПоОстаткамПоНаименованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокиИзПодбора(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиИзПодбора(ДанныеФормыКоллекция)
	
	ТаблицаТоваров = ДанныеФормыКоллекция.Выгрузить(,"Номенклатура,Характеристика,ЗаказКлиента,Количество,Намотка,Город,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки");
	
	// Добавляем недостающие колонки из заказа клиента
	ОбработатьСтрокиПодбораНаСервере(ТаблицаТоваров);
	// Заполняем цену с учетом валюты
	ОбработатьЦеныВТаблицеТоваров(ТаблицаТоваров);
	// Добавляем товары в ТЧ
	ДобавитьТоварыИзТаблицы(ТаблицаТоваров);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокиПодбораНаСервере(ТаблицаТоваров)

	ТаблицаТоваров.Колонки.Добавить("Валюта");
	ТаблицаТоваров.Колонки.Добавить("Лико_ВалютаДляДокументов");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("ЦенаДляДокументов");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	МассивДляУдаления = Новый Массив;
	//НакладнаяНаЭкспорт = Объект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
	//Если НакладнаяНаЭкспорт Тогда
	//	СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
	//ИначеЕсли Объект.Дата >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
	//	СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	//Иначе
	//	СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
	//КонецЕсли;
	Для каждого Строка из ТаблицаТоваров Цикл
		
		// Найдем строку в заказе клиента
		Отбор = Новый Структура("Характеристика,Направление,Город,КодЭтикеткиЗаказчика,ЧестныйЗнак,NКонтракта");
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		Отбор.NКонтракта = Строка.НомерПоставки;
		Отбор.Направление = Строка.Намотка;
		СтрокиЗаказа = Строка.ЗаказКлиента.Товары.НайтиСтроки(Отбор);
		Если СтрокиЗаказа.Количество() = 0 Тогда
			СтрокаЗаказа = Неопределено;
		Иначе
			СтрокаЗаказа = СтрокиЗаказа[0];
		КонецЕсли;
		
		Если СтрокаЗаказа = Неопределено Тогда
			// Поместим строку в массив для удаления
			МассивДляУдаления.Добавить(Строка);
		Иначе
			ЗаполнитьЗначенияСвойств(Строка, СтрокаЗаказа,, "Количество");
			Строка.Валюта = Строка.ЗаказКлиента.Валюта;
			Строка.Лико_ВалютаДляДокументов = Строка.ЗаказКлиента.ВалютаДляДокументов;
			//Строка.СтавкаНДС = СтавкаНДС;
		КонецЕсли;
			
	КонецЦикла;
	
	Для каждого Строка из МассивДляУдаления Цикл
		ТаблицаТоваров.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладПоУмолчаниюНаСервере()
	
	Возврат Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяСГП", ПараметрыСеанса.ТекущийПользователь);
	
КонецФункции

&НаКлиенте
Процедура Лико_СоздатьДоговор(Команда) // --> Начало Лико Ефимов ЕВВ 29.10.2018
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Сообщить("Договор уже заполнен");
		Возврат;
	КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда
		Сообщить("Сначала нужно заполнить товары");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		Сообщить("Заполните партнера");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщить("Заполните контрагента");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Заполните организацию");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
		Сообщить("Заполните валюту");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщить("Заполните дату документа");
		Возврат;
	КонецЕсли;
	
	Лико_СоздатьДоговорНаСервере();
	Объект.НазначениеПлатежа = Неопределено;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 29.10.2018 

&НаСервере
Процедура Лико_СоздатьДоговорНаСервере() // --> Начало Лико Ефимов ЕВВ 29.10.2018
	
	Заказ = Объект.Товары[0].Характеристика.Лико_ЗаказНоменклатуры;
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Сообщить("В первой строке товаров обязательно должна быть заполнена характеристика с заказом");
		Возврат;
	КонецЕсли;
	Объект.Договор = Лико_Дополнительно.ПодобратьДоговор(Заказ, Объект, Истина);

	Лико_ПроверитьИзменитьБанковскийСчетОрганизации();
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 29.10.2018

&НаСервере
Процедура Лико_ПроверитьИзменитьБанковскийСчетОрганизации() // --> Начало Лико Ефимов ЕВВ 22.05.2025
	
	// По просьбе Крапивиной
	Если ЗначениеЗаполнено(Объект.Договор)
		И ЗначениеЗаполнено(Объект.Договор.БанковскийСчет)
		И Объект.БанковскийСчет <> Объект.Договор.БанковскийСчет 
		Тогда
		Объект.БанковскийСчет = Объект.Договор.БанковскийСчет;
		Сообщить("Банковский счет организации в документе был изменен, т.к. в договоре подобрался другой банковский счет организации");
	КонецЕсли; 
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 22.05.2025

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.НазначениеПлатежа = Неопределено;
	// --> Начало Лико Ефимов ЕВВ 22.05.2025
	Лико_ПроверитьИзменитьБанковскийСчетОрганизации();
	// <-- Конец Лико Ефимов ЕВВ 22.05.2025
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИдСтроки = Элементы.Товары.ТекущаяСтрока;
	Если ПроверитьНеобходимостьВводаХарактеристикиДляУслуги(ИдСтроки, СтандартнаяОбработка) Тогда
		ДопПараметры = Новый Структура("ИдСтроки", ИдСтроки);
		ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ВыбранЗаказДляХарактеристикиУслуги", ЭтотОбъект, ДопПараметры));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьВводаХарактеристикиДляУслуги(ИдСтроки, СтандартнаяОбработка)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ИдСтроки);
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
		Сообщить("Сначала выберите номенклатуру");
		СтандартнаяОбработка = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекСтрока.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекСтрока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
		Сообщить("Для выбранной номенклатуры отключено использование характеристик");
		СтандартнаяОбработка = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыбранЗаказДляХарактеристикиУслуги(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Модифицированность = Истина;
		ДопПараметры.Вставить("Заказ", Результат);
		ДобавитьХарактеристикуПоЗаказу(ДопПараметры);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикуПоЗаказу(ДопПараметры)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ДопПараметры.ИдСтроки);
	ТекСтрока.Характеристика = Документы.Лико_ЗаявкаНаОтгрузку.НайтиИлиСоздатьХарактеристикуДляУслуги(ТекСтрока.Номенклатура, ДопПараметры.Заказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаОтгрузку(Команда)
	Если ЕстьШаблоныОтгрузок(Объект.Партнер) Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораШаблонаОтгрузки", ЭтотОбъект);
		Отбор = Новый Структура("Партнер",Объект.Партнер);
		ПараметрыФормы = Новый Структура("Отбор",Отбор);
		ОткрытьФорму("Справочник.Лико_ШаблоныЗаявокНаОтгрузку.ФормаВыбора",ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе   
		Отбор = Новый Структура("Контрагент", Объект.Контрагент);
		Отбор.Вставить("ОрганизацияПродавец", Объект.Организация);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗаявкиНаОтгрузку", ЭтотОбъект);
		ПараметрыФормы = Новый Структура("Отбор",Отбор);
		ОткрытьФорму("Документ.Лико_ЗаявкаНаОтгрузку.ФормаВыбора",ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция ЕстьШаблоныОтгрузок(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ШаблоныЗаявокНаОтгрузку.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ШаблоныЗаявокНаОтгрузку КАК Лико_ШаблоныЗаявокНаОтгрузку
	|ГДЕ
	|	Лико_ШаблоныЗаявокНаОтгрузку.Партнер = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат  Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
КонецФункции



&НаКлиенте
Процедура ПослеВыбораШаблонаОтгрузки(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат <> Неопределено Тогда
		Сп = Новый СписокЗначений;  
		Сп.Добавить(Объект.ссылка);				
		ФормаЗаявки = ПолучитьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаДокумента");
		ДанныеФормы = ФормаЗаявки.Объект; 
		ЗаполнитьЗаявкуНаОтгрузкуНаСервере(ДанныеФормы, Результат, СП);
		КопироватьДанныеФормы(ДанныеФормы, ФормаЗаявки.Объект); // копируем наш объект в объект формы и далее открываем ее
		ФормаЗаявки.Открыть(); 			
   КонецЕсли;	
КонецПроцедуры   


 &НаКлиенте
Процедура ПослеВыбораЗаявкиНаОтгрузку(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат <> Неопределено Тогда
   		Сп = Новый СписокЗначений;  
		Сп.Добавить(Объект.ссылка);		    		
		ФормаЗаявки = ПолучитьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаДокумента");
		ДанныеФормы = ФормаЗаявки.Объект; 
		ЗаполнитьЗаявкуНаОтгрузкупоЗаявкеНаОтгрузку(ДанныеФормы, Результат, СП);
		КопироватьДанныеФормы(ДанныеФормы, ФормаЗаявки.Объект); // копируем наш объект в объект формы и далее открываем ее
		ФормаЗаявки.Открыть();			
   КонецЕсли;	
КонецПроцедуры  



&НаСервере
Функция ЗаполнитьЗаявкуНаОтгрузкуНаСервере(ДанныеФормы, ШаблонЗаявкиНаОтгрузку,СписокЗаказов)    
	
//	Лико_Планирование.ЗаполнитьЗаявкуНаОтгрузкуПоСчетуИШаблону(ДанныеФормы, ШаблонЗаявкиНаОтгрузку,СписокЗаказов);
		
	МетаданныеИсточник = Метаданные.Справочники.Лико_ШаблоныЗаявокНаОтгрузку;
	МетаданныеНазначение= Метаданные.Документы.Лико_ЗаявкаНаОтгрузку; 
	ДокЗаявка = Документы.Лико_ЗаявкаНаОтгрузку.СоздатьДокумент();
    ДокЗаявка.Дата = ТекущаяДата();  
	ДокЗаявка.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан;
	ДокЗаявка.Ответственный = ШаблонЗаявкиНаОтгрузку.Менеджер;

    Для Каждого Реквизит Из МетаданныеИсточник.Реквизиты Цикл
		Имя = Реквизит.Имя;
		Если МетаданныеНазначение.Реквизиты.Найти(Имя) <> Неопределено Тогда
			ДокЗаявка[Имя] =  ШаблонЗаявкиНаОтгрузку[Имя];
		КонецЕсли;
	КонецЦикла;   
	ДокЗаявка.СозданаИзЗаказаСчета = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Количество КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка.Валюта КАК Валюта,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Количество КАК Количество,
	|	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК НомерПоставки,
	|	МАКСИМУМ(ЗаказКлиентаТовары.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
	|	ВТ.Цена КАК Цена,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ВнутреннийДиаметр) КАК Втулка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Направление) КАК Намотка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Город) КАК Город,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ЧестныйЗнак) КАК ЧестныйЗнак,
	|	ВТ.Валюта КАК ВалютаЦены,
	|	ВТ.СчетНаОплату КАК СчетНаОплату
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ВТ.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|			И ВТ.Характеристика = ЗаказКлиентаТовары.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗаказКлиента,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика,
	|	ВТ.Количество,
	|	ВТ.Цена,
	|	ВТ.Валюта,
	|	ВТ.СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	СУММА(Лико_СчетНаОплатуКлиентуТовары.Количество) КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание КАК Содержание
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);  
	ВыборкаЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаТовары  = ВыборкаЗапросов.Получить(1).Выбрать();  
	ВыборкаУслуги = ВыборкаЗапросов.Получить(2).Выбрать(); 
	Пока ВыборкаТовары.Следующий() Цикл
		нстр = ДокЗаявка.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаТовары);
		нстр.Контрагент =   ШаблонЗаявкиНаОтгрузку.Контрагент;
		нстр.АдресДоставки = ШаблонЗаявкиНаОтгрузку.АдресДоставки; 
		нстр.АдресДоставкиЗначенияПолей = ШаблонЗаявкиНаОтгрузку.АдресДоставкиЗначенияПолей; 
		нстр.Грузополучатель = ШаблонЗаявкиНаОтгрузку.Грузополучатель;
		нстр.ОтгрузкаВРублях = ШаблонЗаявкиНаОтгрузку.ОтгрузкаВРублях;  
		нстр.Примечание = ШаблонЗаявкиНаОтгрузку.Примечание;  

	КонецЦикла;
	Пока ВыборкаУслуги.Следующий() Цикл
		нстр = ДокЗаявка.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаУслуги);
	КонецЦикла;

	
	
	
	ЗначениеВДанныеФормы(ДокЗаявка,ДанныеФормы);


КонецФункции


&НаСервере
Функция ЗаполнитьЗаявкуНаОтгрузкупоЗаявкеНаОтгрузку(ДанныеФормы, ЗаявкаНаотгрузку,СписокЗаказов)   
		
	ДокЗаявка = ЗаявкаНаотгрузку.Скопировать();
	ДокЗаявка.Дата = ТекущаяДата(); 
	ДокЗаявка.ДатаОтгрузки = '00010101';
	ДокЗаявка.СозданаИзЗаказаСчета = Истина;

	ДокЗаявка.Товары.Очистить();  
	ДокЗаявка.Услуги.Очистить();
	ДокЗаявка.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан;  
    стр = ЗаявкаНаотгрузку.Товары[0];

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Количество КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка.Валюта КАК Валюта,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Количество КАК Количество,
	|	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК НомерПоставки,
	|	МАКСИМУМ(ЗаказКлиентаТовары.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
	|	ВТ.Цена КАК Цена,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ВнутреннийДиаметр) КАК Втулка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Направление) КАК Намотка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Город) КАК Город,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ЧестныйЗнак) КАК ЧестныйЗнак,
	|	ВТ.Валюта КАК ВалютаЦены,
	|	ВТ.СчетНаОплату КАК СчетНаОплату
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ВТ.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|			И ВТ.Характеристика = ЗаказКлиентаТовары.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗаказКлиента,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика,
	|	ВТ.Количество,
	|	ВТ.Цена,
	|	ВТ.Валюта,
	|	ВТ.СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	СУММА(Лико_СчетНаОплатуКлиентуТовары.Количество) КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание КАК Содержание
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);  
	ВыборкаЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаТовары  = ВыборкаЗапросов.Получить(1).Выбрать();  
	ВыборкаУслуги = ВыборкаЗапросов.Получить(2).Выбрать(); 
	Пока ВыборкаТовары.Следующий() Цикл
		нстр = ДокЗаявка.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаТовары);
		нстр.Контрагент =   стр.Контрагент;
		нстр.АдресДоставки = стр.АдресДоставки; 
		нстр.АдресДоставкиЗначенияПолей = стр.АдресДоставкиЗначенияПолей; 
		нстр.Грузополучатель = стр.Грузополучатель;
		нстр.ОтгрузкаВРублях = стр.ОтгрузкаВРублях;  
		нстр.Примечание = стр.Примечание;  
        нстр.РеальныйДоговор = стр.РеальныйДоговор;  

	КонецЦикла;
	Пока ВыборкаУслуги.Следующий() Цикл
		нстр = ДокЗаявка.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаУслуги);
	КонецЦикла;
	ЗначениеВДанныеФормы(ДокЗаявка,ДанныеФормы);


КонецФункции






ОтветПередЗаписью = Ложь;
